haskell/Tips_And_Tricks.org
#+INCLUDE: ../theme/style.org
#+TITLE: Tips And Tricks
#+DESCRIPTION: Tips and tricks for Haskell development. 
#+STARTUP:  overview

* Tips and Tricks 
** Overview 

It is a collection of many tips and tricks for Haskell development.
