haskell/Tips_And_Tricks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Tips And Tricks</title>
<!-- 2018-06-17 Sun 02:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="nobody" />
<meta  name="description" content="Tips and tricks for Haskell development."
 />
<meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0" />
<link href="/Functional-Programming/theme/style.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">Tips And Tricks</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Tips and Tricks</a>
<ul>
<li><a href="#sec-1-1">1.1. Overview</a></li>
<li><a href="#sec-1-2">1.2. Configuration files in Haskell Syntax</a></li>
<li><a href="#sec-1-3">1.3. Using undefined to specify function signature before implementation</a></li>
<li><a href="#sec-1-4">1.4. Using pattern matching for simple command line application</a></li>
<li><a href="#sec-1-5">1.5. Debug Computations using trace</a></li>
<li><a href="#sec-1-6">1.6. Haskell Interactive Shell - GHCI</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1. GHCI configuration file</a></li>
<li><a href="#sec-1-6-2">1.6.2. Extract contents of IO action</a></li>
<li><a href="#sec-1-6-3">1.6.3. Load interactive commands from file</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<lu> 
  <li><a href="/Functional-Programming/index.html">Index</a></li>
  <li><a href="https://github.com/caiorss/Functional-Programming">Repository</a></li>
</lu>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Tips and Tricks</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
It is a collection of many tips and tricks for Haskell development.
</p>
</div>
</div>
