haskell/Tips_And_Tricks.org
** Configuration files in Haskell Syntax 
   :PROPERTIES:
   :ID:       a795774c-42af-46fb-bbab-9c1d370cfba1
   :END:

Configuration files can be written in Haskell since it provides a
parser (readMaybe) that can read arbitrary data structures defined as
instance of show and read type classes.

Example: 

File: serverConf.hs 

#+BEGIN_SRC haskell :tangle /tmp/serverconf.hs 
  import Text.Read (readMaybe)
  import Text.Printf (printf)
      
  type Password = String
  type Username = String     

  data ServerAuth = AuthEmpty
                  | AuthBasic Username Password
                  deriving (Eq, Read, Show)

  data ServerConf = ServerConf
        {
        serverHost     :: String      
       ,serverPort     :: Int
       ,serverAssets   :: String
       ,serverSecurity :: ServerAuth
        } deriving (Eq, Read, Show)


  readConfig1 :: String -> Maybe ServerConf
  readConfig1 = readMaybe 

  readConfig2 :: String -> Maybe ServerConf
  readConfig2 str = readMaybe str 


  readConfigFile :: String -> IO (Maybe ServerConf)
  readConfigFile configFile = readConfig1 <$> readFile configFile -- Or fmap readConfig1 (readFile configFile)


  runServer :: ServerConf -> IO ()
  runServer config = do printf "Running server at port %d, listening host %s\n" (serverPort config) (serverHost config) 
                        putStrLn $ "Server Authentication = " ++ show (serverSecurity config)


  runServerConfigFile :: String -> IO ()
  runServerConfigFile configFile = do
    config <- readConfigFile configFile
    case config of
      Just conf -> runServer conf
      Nothing   -> putStrLn "Error: I can't read the server configuration file"
                                 


  config1 = ServerConf "0.0.0.0" 8080 "/var/www" AuthEmpty

  config2 = ServerConf { serverHost = "0.0.0.0",
                         serverPort = 9090,
                         serverAssets = "/home/arch/www",
                         serverSecurity = AuthBasic "gh0st" "xmkg3p98sfawgav"
                       }
   
                             
#+END_SRC


Configuration File: server.conf 

#+BEGIN_SRC conf :tangle /tmp/server.conf 
ServerConf {
  serverHost = "127.0.0.1" 
 ,serverPort = 80 
 ,serverAssets = "/var/www"
 ,serverSecurity = AuthBasic "admin" "xjwxfm2pcfg56hga" 
}
#+END_SRC

Load the file in the REPL:

#+BEGIN_SRC haskell 
  > :load /tmp/serverconf.hs 
  [1 of 1] Compiling Main             ( /tmp/serverconf.hs, interpreted )
  Ok, modules loaded: Main.
  > 
  > :t ServerConf 
  ServerConf :: String -> Int -> String -> ServerAuth -> ServerConf
  > 


  > config1
  ServerConf {serverHost = "0.0.0.0", serverPort = 8080, serverAssets = "/var/www", serverSecurity = AuthEmpty}
  >

  > config2
  ServerConf {serverHost = "0.0.0.0", serverPort = 9090, serverAssets = "/home/arch/www", serverSecurity = AuthBasic "gh0st" "xmkg3p98sfawgav"}
  >

  > runServer config1
  Running server at port 8080, listening host 0.0.0.0
  Server Authentication = AuthEmpty
  > 
  > runServer config2
  Running server at port 9090, listening host 0.0.0.0
  Server Authentication = AuthBasic "gh0st" "xmkg3p98sfawgav"
  > 
  >

  -- Read configuration file.
  -- 
  > readConfigFile "/tmp/server.conf" 
  Just (ServerConf {serverHost = "127.0.0.1", serverPort = 80, serverAssets = "/var/www", serverSecurity = AuthBasic "admin" "xjwxfm2pcfg56hga"})
  > 

  > :t readConfigFile "/tmp/server.conf" 
  readConfigFile "/tmp/server.conf" :: IO (Maybe ServerConf)
  > 

  > runServerConfigFile "/tmp/server.conf"
  Running server at port 80, listening host 127.0.0.1
  Server Authentication = AuthBasic "admin" "xjwxfm2pcfg56hga"
  > 
  > runServerConfigFile "/etc/fstab"
  Error: I can't read the server configuration file
  > 


#+END_SRC

