haskell/Tips_And_Tricks.html
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><a id="ID-a795774c-42af-46fb-bbab-9c1d370cfba1" name="ID-a795774c-42af-46fb-bbab-9c1d370cfba1"></a><span class="section-number-3">1.2</span> Configuration files in Haskell Syntax</h3>
<div class="outline-text-3" id="text-1-2">

<p>
Configuration files can be written in Haskell since it provides a
parser (readMaybe) that can read arbitrary data structures defined as
instance of show and read type classes.
</p>

<p>
Example: 
</p>

<p>
File: serverConf.hs 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Read</span> (readMaybe)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Printf</span> (printf)

<span class="org-haskell-keyword">type</span> <span class="org-haskell-type">Password</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-keyword">type</span> <span class="org-haskell-type">Username</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-type">String</span>     

<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">ServerAuth</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">AuthEmpty</span>
                <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">AuthBasic</span> <span class="org-haskell-constructor">Username</span> <span class="org-haskell-constructor">Password</span>
                <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Read</span>, <span class="org-haskell-constructor">Show</span>)

<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">ServerConf</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">ServerConf</span>
      {
      serverHost     <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>      
     ,serverPort     <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
     ,serverAssets   <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
     ,serverSecurity <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ServerAuth</span>
      } <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Read</span>, <span class="org-haskell-constructor">Show</span>)


<span class="org-function-name">readConfig1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">ServerConf</span>
<span class="org-haskell-definition">readConfig1</span> <span class="org-haskell-operator">=</span> readMaybe 

<span class="org-function-name">readConfig2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">ServerConf</span>
<span class="org-haskell-definition">readConfig2</span> str <span class="org-haskell-operator">=</span> readMaybe str 


<span class="org-function-name">readConfigFile</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> (<span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">ServerConf</span>)
<span class="org-haskell-definition">readConfigFile</span> configFile <span class="org-haskell-operator">=</span> readConfig1 <span class="org-haskell-operator">&lt;$&gt;</span> readFile configFile <span class="org-comment-delimiter">-- </span><span class="org-comment">Or fmap readConfig1 (readFile configFile)</span>


<span class="org-function-name">runServer</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ServerConf</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">runServer</span> config <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span> printf <span class="org-string">"Running server at port %d, listening host %s\n"</span> (serverPort config) (serverHost config) 
                      putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Server Authentication = "</span> <span class="org-haskell-operator">++</span> show (serverSecurity config)


<span class="org-function-name">runServerConfigFile</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">runServerConfigFile</span> configFile <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  config <span class="org-haskell-operator">&lt;-</span> readConfigFile configFile
  <span class="org-haskell-keyword">case</span> config <span class="org-haskell-keyword">of</span>
    <span class="org-haskell-constructor">Just</span> conf <span class="org-haskell-operator">-&gt;</span> runServer conf
    <span class="org-haskell-constructor">Nothing</span>   <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-string">"Error: I can't read the server configuration file"</span>



<span class="org-haskell-definition">config1</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">ServerConf</span> <span class="org-string">"0.0.0.0"</span> 8080 <span class="org-string">"/var/www"</span> <span class="org-haskell-constructor">AuthEmpty</span>

<span class="org-haskell-definition">config2</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">ServerConf</span> { serverHost <span class="org-haskell-operator">=</span> <span class="org-string">"0.0.0.0"</span>,
                       serverPort <span class="org-haskell-operator">=</span> 9090,
                       serverAssets <span class="org-haskell-operator">=</span> <span class="org-string">"/home/arch/www"</span>,
                       serverSecurity <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">AuthBasic</span> <span class="org-string">"gh0st"</span> <span class="org-string">"xmkg3p98sfawgav"</span>
                     }
</pre>
</div>


<p>
Configuration File: server.conf 
</p>

<div class="org-src-container">

<pre class="src src-conf"><span class="org-type">ServerConf</span> {
  <span class="org-variable-name">serverHost</span> = <span class="org-string">"127.0.0.1"</span> 
 <span class="org-variable-name">,serverPort</span> = 80 
 <span class="org-variable-name">,serverAssets</span> = <span class="org-string">"/var/www"</span>
 <span class="org-variable-name">,serverSecurity</span> = AuthBasic <span class="org-string">"admin"</span> <span class="org-string">"xjwxfm2pcfg56hga"</span> 
}
</pre>
</div>

<p>
Load the file in the REPL:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>load <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>serverconf<span class="org-haskell-operator">.</span>hs 
[1 <span class="org-haskell-keyword">of</span> 1] <span class="org-haskell-constructor">Compiling</span> <span class="org-haskell-constructor">Main</span>             ( <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>serverconf<span class="org-haskell-operator">.</span>hs, interpreted )
<span class="org-haskell-constructor">Ok</span>, modules loaded<span class="org-haskell-constructor">:</span> Main.
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t <span class="org-haskell-constructor">ServerConf</span> 
<span class="org-function-name">ServerConf</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">ServerAuth</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">ServerConf</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> config1
<span class="org-haskell-constructor">ServerConf</span> {serverHost <span class="org-haskell-operator">=</span> <span class="org-string">"0.0.0.0"</span>, serverPort <span class="org-haskell-operator">=</span> 8080, serverAssets <span class="org-haskell-operator">=</span> <span class="org-string">"/var/www"</span>, serverSecurity <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">AuthEmpty</span>}
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> config2
<span class="org-haskell-constructor">ServerConf</span> {serverHost <span class="org-haskell-operator">=</span> <span class="org-string">"0.0.0.0"</span>, serverPort <span class="org-haskell-operator">=</span> 9090, serverAssets <span class="org-haskell-operator">=</span> <span class="org-string">"/home/arch/www"</span>, serverSecurity <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">AuthBasic</span> <span class="org-string">"gh0st"</span> <span class="org-string">"xmkg3p98sfawgav"</span>}
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runServer</span> config1
<span class="org-haskell-constructor">Running</span> server at port 8080, listening host 0.0<span class="org-haskell-operator">.</span>0.0
<span class="org-haskell-constructor">Server</span> <span class="org-haskell-constructor">Authentication</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">AuthEmpty</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runServer</span> config2
<span class="org-haskell-constructor">Running</span> server at port 9090, listening host 0.0<span class="org-haskell-operator">.</span>0.0
<span class="org-haskell-constructor">Server</span> <span class="org-haskell-constructor">Authentication</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">AuthBasic</span> <span class="org-string">"gh0st"</span> <span class="org-string">"xmkg3p98sfawgav"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Read configuration file.</span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readConfigFile</span> <span class="org-string">"/tmp/server.conf"</span> 
<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">ServerConf</span> {serverHost <span class="org-haskell-operator">=</span> <span class="org-string">"127.0.0.1"</span>, serverPort <span class="org-haskell-operator">=</span> 80, serverAssets <span class="org-haskell-operator">=</span> <span class="org-string">"/var/www"</span>, serverSecurity <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">AuthBasic</span> <span class="org-string">"admin"</span> <span class="org-string">"xjwxfm2pcfg56hga"</span>})
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t readConfigFile <span class="org-string">"/tmp/server.conf"</span> 
<span class="org-haskell-definition">readConfigFile</span> <span class="org-string">"/tmp/server.conf"</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> (<span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">ServerConf</span>)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runServerConfigFile</span> <span class="org-string">"/tmp/server.conf"</span>
<span class="org-haskell-constructor">Running</span> server at port 80, listening host 127.0<span class="org-haskell-operator">.</span>0.1
<span class="org-haskell-constructor">Server</span> <span class="org-haskell-constructor">Authentication</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">AuthBasic</span> <span class="org-string">"admin"</span> <span class="org-string">"xjwxfm2pcfg56hga"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runServerConfigFile</span> <span class="org-string">"/etc/fstab"</span>
<span class="org-function-name">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">I</span> can't read the server configuration file
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
