haskell/Tips_And_Tricks.org
** Using undefined to specify function signature before implementation
   :PROPERTIES:
   :ID:       21aa4a3c-16d1-407c-a497-f4cbaf28ef5f
   :END:

Undefined can be used to define function signatures before they are implemented.

Example:

File: math1.hs - Before implement the functions.

#+BEGIN_SRC haskell :tangle /tmp/math1.hs 
  add :: Int -> Int -> Int
  add = undefined

  sub :: Int -> Int -> Int
  sub x y = x - y        
        
  product :: Num a => [a] -> a
  product = undefined            
#+END_SRC

Load in the Repl: 

#+BEGIN_SRC haskell 
  > :load /tmp/math1.hs 
  [1 of 1] Compiling Main             ( /tmp/math1.hs, interpreted )
  Ok, modules loaded: Main.
  > 

  > :t add
  add :: Int -> Int -> Int
  >
  > :t Main.add
  Main.add :: Int -> Int -> Int
  > 


  > :t product

  <interactive>:1:1:
      Ambiguous occurrence ‘product’
      It could refer to either ‘Main.product’,
                               defined at /tmp/math1.hs:6:1
                            or ‘Prelude.product’,
                               imported from ‘Prelude’ at /tmp/math1.hs:1:1
                               (and originally defined in ‘Data.Foldable’)
  > 

  > :t Main.product
  Main.product :: Num a => [a] -> a
  > 

  > Main.add 3 5
  ,*** Exception: Prelude.undefined
  > 

  > Main.product [1, 2, 3, 4, 5]
  ,*** Exception: Prelude.undefined
  > 

#+END_SRC


File: math1.hs after implement the functions. 

#+BEGIN_SRC haskell :tangle /tmp/math2.hs 
  add :: Int -> Int -> Int
  add = \x y -> x + y

  sub :: Int -> Int -> Int
  sub x y = x - y        
        
  product :: Num a => [a] -> a
  product xs = foldr (*) 1 xs             
#+END_SRC

Loading in the repl: 

#+BEGIN_SRC haskell 
  > :t add
  add :: Int -> Int -> Int
  > 
  > add 3 5
  8
  >

  > Main.add 3 5
  8
  > 


  > :t product 

  <interactive>:1:1:
      Ambiguous occurrence ‘product’
      It could refer to either ‘Main.product’,
                               defined at /tmp/math2.hs:9:1
                            or ‘Prelude.product’,
                               imported from ‘Prelude’ at /tmp/math2.hs:1:1
                               (and originally defined in ‘Data.Foldable’)
  > 
  > 
  > Main.product [1, 2, 3, 4, 5]
  120
  > :t Main.product
  Main.product :: Num a => [a] -> a
  > 
#+END_SRC
