haskell/Tips_And_Tricks.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><a id="ID-21aa4a3c-16d1-407c-a497-f4cbaf28ef5f" name="ID-21aa4a3c-16d1-407c-a497-f4cbaf28ef5f"></a><span class="section-number-3">1.3</span> Using undefined to specify function signature before implementation</h3>
<div class="outline-text-3" id="text-1-3">

<p>
Undefined can be used to define function signatures before they are implemented.
</p>

<p>
Example:
</p>

<p>
File: math1.hs - Before implement the functions.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">add</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">add</span> <span class="org-haskell-operator">=</span> undefined

<span class="org-function-name">sub</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">sub</span> x y <span class="org-haskell-operator">=</span> x <span class="org-haskell-operator">-</span> y        

<span class="org-function-name">product</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-definition">product</span> <span class="org-haskell-operator">=</span> undefined
</pre>
</div>

<p>
Load in the Repl: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>load <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>math1<span class="org-haskell-operator">.</span>hs 
[1 <span class="org-haskell-keyword">of</span> 1] <span class="org-haskell-constructor">Compiling</span> <span class="org-haskell-constructor">Main</span>             ( <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>math1<span class="org-haskell-operator">.</span>hs, interpreted )
<span class="org-haskell-constructor">Ok</span>, modules loaded<span class="org-haskell-constructor">:</span> Main.
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t add
<span class="org-function-name">add</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t Main.add
<span class="org-function-name">Main.add</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t product

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>1<span class="org-haskell-type">:</span>1<span class="org-haskell-type">:</span>
    <span class="org-haskell-type">Ambiguous</span> occurrence &#8216;product&#8217;
    <span class="org-haskell-constructor">It</span> could refer to either &#8216;Main.product&#8217;,
                             defined at <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>math1<span class="org-haskell-operator">.</span>hs<span class="org-haskell-constructor">:</span>6<span class="org-haskell-constructor">:</span>1
                          or &#8216;Prelude.product&#8217;,
                             imported from &#8216;<span class="org-haskell-constructor">Prelude</span>&#8217; at <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>math1<span class="org-haskell-operator">.</span>hs<span class="org-haskell-constructor">:</span>1<span class="org-haskell-constructor">:</span>1
                             (and originally defined <span class="org-haskell-keyword">in</span> &#8216;<span class="org-haskell-constructor">Data.Foldable</span>&#8217;)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t Main.product
<span class="org-function-name">Main.product</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> Main<span class="org-haskell-definition">.</span>add 3 5
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> Prelude.undefined
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> Main<span class="org-haskell-definition">.</span>product [1, 2, 3, 4, 5]
<span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> Prelude.undefined
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
File: math1.hs after implement the functions. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">add</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">add</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">\</span>x y <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> y

<span class="org-function-name">sub</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">sub</span> x y <span class="org-haskell-operator">=</span> x <span class="org-haskell-operator">-</span> y        

<span class="org-function-name">product</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-definition">product</span> xs <span class="org-haskell-operator">=</span> foldr (<span class="org-haskell-operator">*</span>) 1 xs
</pre>
</div>

<p>
Loading in the repl: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t add
<span class="org-function-name">add</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">add</span> 3 5
8
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> Main<span class="org-haskell-definition">.</span>add 3 5
8
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t product 

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>1<span class="org-haskell-constructor">:</span>1<span class="org-haskell-constructor">:</span>
    <span class="org-haskell-constructor">Ambiguous</span> occurrence &#8216;product&#8217;
    <span class="org-haskell-constructor">It</span> could refer to either &#8216;Main.product&#8217;,
                             defined at <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>math2<span class="org-haskell-operator">.</span>hs<span class="org-haskell-constructor">:</span>9<span class="org-haskell-constructor">:</span>1
                          or &#8216;Prelude.product&#8217;,
                             imported from &#8216;<span class="org-haskell-constructor">Prelude</span>&#8217; at <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>math2<span class="org-haskell-operator">.</span>hs<span class="org-haskell-constructor">:</span>1<span class="org-haskell-constructor">:</span>1
                             (and originally defined <span class="org-haskell-keyword">in</span> &#8216;<span class="org-haskell-constructor">Data.Foldable</span>&#8217;)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> Main<span class="org-haskell-definition">.</span>product [1, 2, 3, 4, 5]
120
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t Main.product
<span class="org-function-name">Main.product</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
