haskell/Tips_And_Tricks.html
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><a id="ID-84ba0fa5-63d2-4392-bbcf-9a94dfa38fa9" name="ID-84ba0fa5-63d2-4392-bbcf-9a94dfa38fa9"></a><span class="section-number-3">1.4</span> Using pattern matching for simple command line application</h3>
<div class="outline-text-3" id="text-1-4">

<p>
The pattern match is useful to develop simple command line
applications in a declarative and robust way. 
</p>

<p>
File: calculator.hs 
</p>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.Environment</span>  (getArgs)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.Exit</span> (exitFailure, exitSuccess)   
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Read</span> (readMaybe)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span> 

<span class="org-function-name">parseNum</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Double</span> 
<span class="org-haskell-definition">parseNum</span> <span class="org-haskell-operator">=</span> readMaybe    

<span class="org-function-name">parseNumList</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">String</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Double</span>]
<span class="org-haskell-definition">parseNumList</span> xs <span class="org-haskell-operator">=</span> mapM readMaybe xs                

<span class="org-doc">{- | Perform operation on a single command line argument -}</span>                  
<span class="org-function-name">doOperation</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> b <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> (<span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">doOperation</span> fn fnParser arg <span class="org-haskell-operator">=</span>
    <span class="org-haskell-keyword">case</span> fnParser arg <span class="org-haskell-keyword">of</span>
      <span class="org-haskell-constructor">Just</span> x  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Result = "</span> <span class="org-haskell-operator">++</span> show (fn x)
                    exitSuccess

      <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Error: Invalid input '"</span> <span class="org-haskell-operator">++</span> arg <span class="org-haskell-operator">++</span> <span class="org-string">"'"</span>
                    exitFailure 

<span class="org-doc">{- | Perform operation on multiple command line arguments -}</span>
<span class="org-function-name">doListOperation</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> b <span class="org-haskell-operator">=&gt;</span> ([a] <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> ([<span class="org-haskell-type">String</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> [a]) <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">String</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> 
<span class="org-haskell-definition">doListOperation</span> fn fnParser args <span class="org-haskell-operator">=</span>
    <span class="org-haskell-keyword">case</span> fnParser args <span class="org-haskell-keyword">of</span>
      <span class="org-haskell-constructor">Just</span> xs <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Result = "</span> <span class="org-haskell-operator">++</span> show (fn xs)
                    exitSuccess

      <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Error: Invalid input '"</span> <span class="org-haskell-operator">++</span> show args <span class="org-haskell-operator">++</span> <span class="org-string">"'"</span>
                    exitFailure


<span class="org-haskell-definition">showHelp</span> <span class="org-haskell-operator">=</span> putStrLn <span class="org-haskell-operator">$</span> unlines [
             <span class="org-string">"Calculator App"</span>
            ,<span class="org-string">"\nOptions\n"</span>
            ,<span class="org-string">" -help           - Show help"</span>
            ,<span class="org-string">" -pi             - Show pi number"</span>
            ,<span class="org-string">" -exp x          - Compute exponential"</span>
            ,<span class="org-string">" -sin x          - Compute sin"</span>
            ,<span class="org-string">" -echo file      - Display file"</span>
            ,<span class="org-string">" -sum 10 20 30   - Compute sum"</span>
            ,<span class="org-string">" -prod 10 20 30  - Compute product"</span>

            ]


<span class="org-haskell-definition">echoFile</span> file <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  content <span class="org-haskell-operator">&lt;-</span> readFile file
  putStrLn content

<span class="org-function-name">parseArgs</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">String</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">parseArgs</span> args <span class="org-haskell-operator">=</span>
    <span class="org-haskell-keyword">case</span> args <span class="org-haskell-keyword">of</span>
      <span class="org-haskell-constructor">[]</span>                <span class="org-haskell-operator">-&gt;</span> showHelp <span class="org-haskell-operator">&gt;&gt;</span> exitSuccess
      [<span class="org-string">"-pi"</span>]           <span class="org-haskell-operator">-&gt;</span> putStrLn (show 3.1415) <span class="org-haskell-operator">&gt;&gt;</span> exitSuccess                     
      [<span class="org-string">"-help"</span>]         <span class="org-haskell-operator">-&gt;</span> showHelp <span class="org-haskell-operator">&gt;&gt;</span> exitSuccess
      [<span class="org-string">"-exp"</span>, x]       <span class="org-haskell-operator">-&gt;</span> doOperation exp parseNum x
      [<span class="org-string">"-sin"</span>, x]       <span class="org-haskell-operator">-&gt;</span> doOperation sin parseNum x
      [<span class="org-string">"-cos"</span>, x]       <span class="org-haskell-operator">-&gt;</span> doOperation cos parseNum x                     
      [<span class="org-string">"-echo"</span>, file]   <span class="org-haskell-operator">-&gt;</span> echoFile file                      
      <span class="org-string">"-sum"</span><span class="org-haskell-constructor">:</span>args       <span class="org-haskell-operator">-&gt;</span> doListOperation sum parseNumList args
      <span class="org-string">"-prod"</span><span class="org-haskell-constructor">:</span>args      <span class="org-haskell-operator">-&gt;</span> doListOperation product parseNumList args
      <span class="org-haskell-keyword">_</span>                 <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-string">"Error: Invalid command line switches."</span>
                              exitFailure
<span class="org-comment-delimiter">{-</span>
<span class="org-comment">Or </span>
<span class="org-comment">   main :: IO () </span>
<span class="org-comment">   main = do </span>
<span class="org-comment">      args &lt;- getArgs </span>
<span class="org-comment">      parseArgs args </span>


<span class="org-comment">-}</span>                           
<span class="org-function-name">main</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> 
<span class="org-haskell-definition">main</span> <span class="org-haskell-operator">=</span> getArgs <span class="org-haskell-operator">&gt;&gt;=</span> parseArgs
</pre>
</div>

<p>
<b>Command line tests:</b>
</p>

<p>
Running in as script:
</p>

<div class="org-src-container">

<pre class="src src-sh">$ stack exec -- runhaskell /tmp/calculator.hs 
Calculator App

Options

 -help           - Show help
 -pi             - Show pi number
 -exp x          - Compute exponential
 -sin x          - Compute sin
 -echo file      - Display file
 -sum 10 20 30   - Compute sum
 -prod 10 20 30  - Compute product


$ stack exec -- runhaskell /tmp/calculator.hs -help
Calculator App

Options

 -help           - Show help
 -pi             - Show pi number
 -exp x          - Compute exponential
 -sin x          - Compute sin
 -echo file      - Display file
 -sum 10 20 30   - Compute sum
 -prod 10 20 30  - Compute product


$ stack exec -- runhaskell /tmp/calculator.hs sada
<span class="org-function-name">Error</span>: Invalid command line switches.


$ stack exec -- runhaskell /tmp/calculator.hs -exp 1.0
Result = 2.718281828459045

$ stack exec -- runhaskell /tmp/calculator.hs -exp 2.0
Result = 7.38905609893065

$ stack exec -- runhaskell /tmp/calculator.hs -sin 3.1415
Result = 9.265358966049026e-5

$ stack exec -- runhaskell /tmp/calculator.hs -cos x2323
<span class="org-function-name">Error</span>: Invalid input <span class="org-string">'x2323'</span>

$ stack exec -- runhaskell /tmp/calculator.hs -cos
<span class="org-function-name">Error</span>: Invalid command line switches.

$ stack exec -- runhaskell /tmp/calculator.hs -sum 1 2 3 4 5
Result = 15.0

$ stack exec -- runhaskell /tmp/calculator.hs -prod 1 2 3 4 5 
Result = 120.0

$ stack exec -- runhaskell /tmp/calculator.hs -prod 1 2 3 sads 4 5 
<span class="org-function-name">Error</span>: Invalid input <span class="org-string">'["1","2","3","sads","4","5"]'</span>

$ stack exec -- runhaskell /tmp/calculator.hs -echo /etc/issue
Manjaro Linux \r  (\n) (\l)
</pre>
</div>

<p>
Compiling:
</p>

<div class="org-src-container">

<pre class="src src-sh">$ stack exec -- ghc /tmp/calculator.hs -o <span class="org-keyword">/tmp/calculator.bin</span>
<span class="org-keyword">[1</span> of 1] Compiling Main             ( /tmp/calculator.hs, /tmp/calculator.o )
Linking /tmp/calculator.bin ...

$ file /tmp/calculator.bin 
<span class="org-function-name">/tmp/calculator.bin</span>: ELF 64-bit LSB executable, x86-64, version 1 (SYSV), dynamically linked, interpreter /lib64/ld-linux-x86-64.so.2, for GNU/Linux 2.6.32, <span class="org-variable-name">BuildID</span>[sha1]=b3a0da3f4814ef85dd257b9e81651e2d234bb026, not stripped, with debug_info


$ /tmp/calculator.bin 
Calculator App

Options

 -help           - Show help
 -pi             - Show pi number
 -exp x          - Compute exponential
 -sin x          - Compute sin
 -echo file      - Display file
 -sum 10 20 30   - Compute sum
 -prod 10 20 30  - Compute product

$ /tmp/calculator.bin -pi
3.1415


$ /tmp/calculator.bin -exp pi
<span class="org-function-name">Error</span>: Invalid input <span class="org-string">'pi'</span>


$ /tmp/calculator.bin -exp 3.1415
Result = 23.138548663861286


$ /tmp/calculator.bin -sum 1 2 3 4 5 6 7
Result = 28.0


$ /tmp/calculator.bin -sum 1 nothing 3 4 5 6 asdas
<span class="org-function-name">Error</span>: Invalid input <span class="org-string">'["1","nothing","3","4","5","6","asdas"]'</span>

$ /tmp/calculator.bin -echo /etc/lsb-release
<span class="org-variable-name">DISTRIB_ID</span>=ManjaroLinux
<span class="org-variable-name">DISTRIB_RELEASE</span>=17.0
<span class="org-variable-name">DISTRIB_CODENAME</span>=Gellivara
<span class="org-variable-name">DISTRIB_DESCRIPTION</span>=<span class="org-string">"Manjaro Linux"</span>
</pre>
</div>

<p>
Testing in REPL:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t parseArgs 
<span class="org-function-name">parseArgs</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">String</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">parseArgs</span> [<span class="org-string">"-help"</span>]
<span class="org-haskell-constructor">Calculator</span> <span class="org-haskell-constructor">App</span>

<span class="org-haskell-constructor">Options</span>

 <span class="org-haskell-operator">-</span>help           <span class="org-haskell-operator">-</span> <span class="org-haskell-constructor">Show</span> help
 <span class="org-haskell-operator">-</span>pi             <span class="org-haskell-operator">-</span> <span class="org-haskell-constructor">Show</span> pi number
 <span class="org-haskell-operator">-</span>exp x          <span class="org-haskell-operator">-</span> <span class="org-haskell-constructor">Compute</span> exponential
 <span class="org-haskell-operator">-</span>sin x          <span class="org-haskell-operator">-</span> <span class="org-haskell-constructor">Compute</span> sin
 <span class="org-haskell-operator">-</span>echo file      <span class="org-haskell-operator">-</span> <span class="org-haskell-constructor">Display</span> file
 <span class="org-haskell-operator">-</span>sum 10 20 30   <span class="org-haskell-operator">-</span> <span class="org-haskell-constructor">Compute</span> sum
 <span class="org-haskell-operator">-</span>prod 10 20 30  <span class="org-haskell-operator">-</span> <span class="org-haskell-constructor">Compute</span> product

<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">ExitSuccess</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">parseArgs</span> [<span class="org-string">"-help"</span>, <span class="org-string">"qasdas"</span>, <span class="org-string">"seds"</span>]
<span class="org-function-name">Error</span><span class="org-haskell-definition">:</span> <span class="org-haskell-constructor">Invalid</span> command line switches<span class="org-haskell-operator">.</span>
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">ExitFailure</span> 1
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">parseArgs</span> [<span class="org-string">"-pi"</span>]
3.1415
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">ExitSuccess</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">parseArgs</span> [<span class="org-string">"-exp"</span>, <span class="org-string">"1.23"</span>]
<span class="org-haskell-constructor">Result</span> <span class="org-haskell-operator">=</span> 3.4212295362896734
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">ExitSuccess</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">parseArgs</span> [<span class="org-string">"-sum"</span>, <span class="org-string">"1.23"</span>, <span class="org-string">"2.323"</span>, <span class="org-string">"4.23"</span>]
<span class="org-haskell-constructor">Result</span> <span class="org-haskell-operator">=</span> 7.783
<span class="org-haskell-operator">***</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">ExitSuccess</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">parseArgs</span> [<span class="org-string">"-echo"</span>, <span class="org-string">"/etc/lsb-release"</span>]
<span class="org-haskell-constructor">DISTRIB_ID</span><span class="org-haskell-operator">=</span><span class="org-haskell-constructor">ManjaroLinux</span>
<span class="org-haskell-constructor">DISTRIB_RELEASE</span><span class="org-haskell-operator">=</span>17.0
<span class="org-haskell-constructor">DISTRIB_CODENAME</span><span class="org-haskell-operator">=</span><span class="org-haskell-constructor">Gellivara</span>
<span class="org-haskell-constructor">DISTRIB_DESCRIPTION</span><span class="org-haskell-operator">=</span><span class="org-string">"Manjaro Linux"</span>

<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
