haskell/Tips_And_Tricks.html

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Debug Computations using trace</h3>
<div class="outline-text-3" id="text-1-5">
<p>
The module Debug.Trace provides functions to allow debug
computations. 
</p>


<ul class="org-ul">
<li>Module: <a href="https://hackage.haskell.org/package/base-4.9.0.0/docs/Debug-Trace.html">Debug.Trace</a>
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Function</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">trace</td>
<td class="left">::</td>
<td class="left">String -&gt; a -&gt; a</td>
<td class="left">Print the first argument (string) and returns the second.</td>
</tr>

<tr>
<td class="left">traceShow</td>
<td class="left">::</td>
<td class="left">Show a =&gt; a -&gt; b -&gt; b</td>
<td class="left">Print the first value and returns the second.</td>
</tr>

<tr>
<td class="left">traceIO</td>
<td class="left">::</td>
<td class="left">String -&gt; IO ()</td>
<td class="left">Like trace but works in a IO Monad.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>


<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Debug.Trace</span>

<span class="org-haskell-keyword">let</span> x <span class="org-haskell-operator">=</span> 10 <span class="org-haskell-operator">+</span> 20 <span class="org-haskell-keyword">in</span> trace (<span class="org-string">"the value of (10 + 20) is = "</span> <span class="org-haskell-operator">++</span> show x) x
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">the</span> value <span class="org-haskell-keyword">of</span> (10 <span class="org-haskell-operator">+</span> 20) is <span class="org-haskell-operator">=</span> 30
30
it


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">factorial</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integer</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Integer</span>
<span class="org-haskell-definition">factorial</span> 0 <span class="org-haskell-operator">=</span> 1
<span class="org-haskell-definition">factorial</span> n <span class="org-haskell-operator">=</span> trace (<span class="org-string">"n = "</span> <span class="org-haskell-operator">++</span> show n) n <span class="org-haskell-operator">*</span> factorial (n <span class="org-haskell-operator">-</span>1)
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">factorial</span> 5
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 5
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 4
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 3
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 2
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 1
120
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integer</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">factorial</span> 10
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 10
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 9
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 8
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 7
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 6
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 5
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 4
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 3
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 2
<span class="org-haskell-definition">n</span> <span class="org-haskell-operator">=</span> 1
3628800
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integer</span>
<span class="org-haskell-operator">&gt;</span>



<span class="org-haskell-type">:</span>{    
<span class="org-function-name">myfoldl</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> acc <span class="org-haskell-operator">=&gt;</span> (acc <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">-&gt;</span> acc) <span class="org-haskell-operator">-&gt;</span> acc <span class="org-haskell-operator">-&gt;</span> [x] <span class="org-haskell-operator">-&gt;</span> acc
<span class="org-haskell-definition">myfoldl</span> step acc <span class="org-haskell-constructor">[]</span>      <span class="org-haskell-operator">=</span>  acc
<span class="org-haskell-definition">myfoldl</span> step acc (x<span class="org-haskell-constructor">:</span>xs)  <span class="org-haskell-operator">=</span>  myfoldl step (step acc x) xs                       
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">myfoldl</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span>x) 0 [1, 2, 3, 4, 5]
12345
<span class="org-haskell-operator">&gt;</span>     


<span class="org-haskell-constructor">:</span>{    
<span class="org-function-name">myfoldl2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> acc <span class="org-haskell-operator">=&gt;</span> (acc <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">-&gt;</span> acc) <span class="org-haskell-operator">-&gt;</span> acc <span class="org-haskell-operator">-&gt;</span> [x] <span class="org-haskell-operator">-&gt;</span> acc
<span class="org-haskell-definition">myfoldl2</span> step acc <span class="org-haskell-constructor">[]</span>      <span class="org-haskell-operator">=</span>  acc
<span class="org-haskell-definition">myfoldl2</span> step acc (x<span class="org-haskell-constructor">:</span>xs)  <span class="org-haskell-operator">=</span>  <span class="org-haskell-keyword">let</span> acc' <span class="org-haskell-operator">=</span> step acc x
                             <span class="org-haskell-keyword">in</span> trace (<span class="org-string">"acc' = "</span> <span class="org-haskell-operator">++</span> show acc') <span class="org-haskell-operator">$</span> myfoldl2 step acc' xs                       
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span>  myfoldl2 (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span>x) 0 [1, 2, 3, 4, 5]
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 1
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 12
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 123
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 1234
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 12345
12345
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> result <span class="org-haskell-operator">=</span>  myfoldl2 (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span>x) 0 [1, 2, 3, 4, 5]

<span class="org-haskell-operator">&gt;</span> result
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 1
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 12
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 123
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 1234
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 12345
12345

<span class="org-haskell-operator">&gt;</span> result
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 1
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 12
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 123
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 1234
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 12345
12345

<span class="org-haskell-operator">&gt;</span> result <span class="org-haskell-definition">*</span> 3
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 1
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 12
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 123
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 1234
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 12345
37035
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">traceLabel</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a 
<span class="org-haskell-definition">traceLabel</span> label value <span class="org-haskell-operator">=</span> trace (label <span class="org-haskell-operator">++</span> show value) value
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{    
<span class="org-function-name">myfoldl3</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> acc <span class="org-haskell-operator">=&gt;</span> (acc <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">-&gt;</span> acc) <span class="org-haskell-operator">-&gt;</span> acc <span class="org-haskell-operator">-&gt;</span> [x] <span class="org-haskell-operator">-&gt;</span> acc
<span class="org-haskell-definition">myfoldl3</span> step acc <span class="org-haskell-constructor">[]</span>      <span class="org-haskell-operator">=</span>  acc
<span class="org-haskell-definition">myfoldl3</span> step acc (x<span class="org-haskell-constructor">:</span>xs)  <span class="org-haskell-operator">=</span>  myfoldl3 step (traceLabel <span class="org-string">"acc' = "</span> <span class="org-haskell-operator">$</span> step acc x) xs                       
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span>  myfoldl3 (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span>x) 0 [1, 2, 3, 4, 5]
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 1
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 12
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 123
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 1234
<span class="org-haskell-definition">acc'</span> <span class="org-haskell-operator">=</span> 12345
12345
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Haskell Interactive Shell - GHCI</h3>
