haskell/Tips_And_Tricks.org
*** GHCI configuration file 

*Example - GHCI without configuration file*

#+BEGIN_SRC haskell
  $ stack ghci
  Configuring GHCi with the following packages: 
  GHCi, version 8.0.1: http://www.haskell.org/ghc/  :? for help
  Loaded GHCi configuration from /tmp/ghci7713/ghci-script
  Prelude> 
  Prelude> import Control.Monad
  Prelude Control.Monad> 

  Prelude Control.Monad> import System.Directory as D
  Prelude Control.Monad D> 

  Prelude Control.Monad D> D.getDirectoryContents "/etc/" >>= mapM_ putStrLn
  systemd
  motd
  adobe
  ld.so.cache
  environment
  libreoffice
  rc_keymaps
  sensors3.conf
  gshadow
  acpi
  pkcs11
  modules-load.d
  cron.deny
  shadow-
  gufw
  security
  tmpfiles.d
  ... ...         

  Prelude Control.Monad D> 
  Prelude Control.Monad D> :{
  Prelude Control.Monad D| getPassword :: String -> IO () -> IO () -> IO ()         
  Prelude Control.Monad D| getPassword password success error = do
  Prelude Control.Monad D|   passwd <- putStr "Enter the password: " >> getLine 
  Prelude Control.Monad D|   if passwd == password
  Prelude Control.Monad D|   then success
  Prelude Control.Monad D|   else do error
  Prelude Control.Monad D|           getPassword password success error
  Prelude Control.Monad D| :}
  Prelude Control.Monad D> 

#+END_SRC

*Example - GHCI with configuration file*

File: ~/.ghci 

#+BEGIN_SRC haskell
import Control.Concurrent (forkIO, threadDelay)
import System.Directory (getCurrentDirectory)

-- Set prompts

:set prompt "> "
:set prompt2 "- "

-- Print type after evaluation 
:set +t 

-- Start at tmp directory 
:cd /tmp

-- Add language extensions 
:set -XFlexibleInstances

putStrLn "Wellcome to Haskell"
#+END_SRC

GHCI Repl:

#+BEGIN_SRC haskell 
  $ stack ghci
  Configuring GHCi with the following packages: 
  GHCi, version 8.0.1: http://www.haskell.org/ghc/  :? for help
  Wellcome to Haskell
  it :: ()
  Loaded GHCi configuration from /home/archbox/.ghci
  Loaded GHCi configuration from /tmp/ghci8295/ghci-script
  > 

  > import Control.Monad
  > import System.Directory as D
  > 
  > D.getDirectoryContents "/etc/" >>= mapM_ putStrLn
  systemd
  motd
  adobe
  ld.so.cache
  environment
  libreoffice
  rc_keymaps
  sensors3.conf
  gshadow

  ... ... ...

  -- Paste this function
  {-
  getPassword :: String -> IO () -> IO () -> IO ()         
  getPassword password success error = do
    passwd <- putStr "Enter the password: " >> getLine 
    if passwd == password
    then success
    else do error
            getPassword password success error
  -}

  > :{
  - getPassword :: String -> IO () -> IO () -> IO ()         
  - getPassword password success error = do
  -   passwd <- putStr "Enter the password: " >> getLine 
  -   if passwd == password
  -   then success
  -   else do error
  -           getPassword password success error
  - :}
  getPassword :: String -> IO () -> IO () -> IO ()
  >


  > let fn a b = 10 * a - b
  fn :: Num a => a -> a -> a
  > fn 10 20
  80
  it :: Num a => a
  > it
  80
  it :: Num a => a
  > 

  > :t forkIO
  forkIO :: IO () -> IO GHC.Conc.Sync.ThreadId

  > :t threadDelay 
  threadDelay :: Int -> IO ()
  > 
            

  > forkIO (forever $ threadDelay 1000000 >> putStrLn "Repeat forever with 1 second delay")
  ThreadId 82
  it :: GHC.Conc.Sync.ThreadId
  > Repeat forever with 1 second delay
  Repeat forever with 1 second delay
  Repeat forever with 1 second delay
  Repeat forever with 1 second delay
  Repeat forever with 1 second delay
  Repeat forever with 1 second delay
  Repeat forever with 1 second delay
  Repeat forever with 1 second delay
       .. ... ... ...
     
#+END_SRC

