haskell/Tips_And_Tricks.html
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> GHCI configuration file</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
<b>Example - GHCI without configuration file</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">$</span> stack ghci
<span class="org-haskell-constructor">Configuring</span> <span class="org-haskell-constructor">GHCi</span> with the following packages<span class="org-haskell-constructor">:</span> 
<span class="org-haskell-constructor">GHCi</span>, version 8.0<span class="org-haskell-operator">.</span>1<span class="org-haskell-constructor">:</span> http<span class="org-haskell-constructor">://</span>www<span class="org-haskell-operator">.</span>haskell<span class="org-haskell-operator">.</span>org<span class="org-haskell-operator">/</span>ghc<span class="org-haskell-operator">/</span>  <span class="org-haskell-constructor">:?</span> for help
<span class="org-haskell-constructor">Loaded</span> <span class="org-haskell-constructor">GHCi</span> configuration from <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>ghci7713<span class="org-haskell-operator">/</span>ghci<span class="org-haskell-operator">-</span>script
<span class="org-haskell-constructor">Prelude</span><span class="org-haskell-definition">&gt;</span> 
<span class="org-haskell-constructor">Prelude</span><span class="org-haskell-definition">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span><span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.Directory</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">D</span>
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">&gt;</span> D.getDirectoryContents <span class="org-string">"/etc/"</span> <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ putStrLn
systemd
motd
adobe
ld<span class="org-haskell-definition">.</span>so<span class="org-haskell-operator">.</span>cache
environment
libreoffice
rc_keymaps
sensors3<span class="org-haskell-definition">.</span>conf
gshadow
acpi
pkcs11
modules<span class="org-haskell-definition">-</span>load<span class="org-haskell-operator">.</span>d
cron<span class="org-haskell-definition">.</span>deny
shadow<span class="org-haskell-definition">-</span>
gufw
security
tmpfiles<span class="org-haskell-definition">.</span>d
<span class="org-haskell-operator">...</span> <span class="org-haskell-operator">...</span>         

<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>{
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">|</span> getPassword <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>         
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">|</span> getPassword password success error <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">|</span>   passwd <span class="org-haskell-operator">&lt;-</span> putStr <span class="org-string">"Enter the password: "</span> <span class="org-haskell-operator">&gt;&gt;</span> getLine 
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">|</span>   <span class="org-haskell-keyword">if</span> passwd <span class="org-haskell-operator">==</span> password
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">|</span>   <span class="org-haskell-keyword">then</span> success
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">|</span>   <span class="org-haskell-keyword">else</span> <span class="org-haskell-keyword">do</span> error
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">|</span>           getPassword password success error
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">:</span>}
<span class="org-haskell-constructor">Prelude</span> <span class="org-haskell-constructor">Control.Monad</span> <span class="org-haskell-constructor">D</span><span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>Example - GHCI with configuration file</b>
</p>

<p>
File: ~/.ghci 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Concurrent</span> (forkIO, threadDelay)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.Directory</span> (getCurrentDirectory)

<span class="org-comment-delimiter">-- </span><span class="org-comment">Set prompts</span>

<span class="org-haskell-constructor">:</span>set prompt <span class="org-string">"&gt; "</span>
<span class="org-haskell-constructor">:</span>set prompt2 <span class="org-string">"- "</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Print type after evaluation </span>
<span class="org-haskell-constructor">:</span>set <span class="org-haskell-operator">+</span>t 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Start at tmp directory </span>
<span class="org-haskell-constructor">:</span>cd <span class="org-haskell-operator">/</span>tmp

<span class="org-comment-delimiter">-- </span><span class="org-comment">Add language extensions </span>
<span class="org-haskell-constructor">:</span>set <span class="org-haskell-operator">-</span><span class="org-haskell-constructor">XFlexibleInstances</span>

<span class="org-haskell-definition">putStrLn</span> <span class="org-string">"Wellcome to Haskell"</span>
</pre>
</div>

<p>
GHCI Repl:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">$</span> stack ghci
<span class="org-haskell-constructor">Configuring</span> <span class="org-haskell-constructor">GHCi</span> with the following packages<span class="org-haskell-constructor">:</span> 
<span class="org-haskell-constructor">GHCi</span>, version 8.0<span class="org-haskell-operator">.</span>1<span class="org-haskell-constructor">:</span> http<span class="org-haskell-constructor">://</span>www<span class="org-haskell-operator">.</span>haskell<span class="org-haskell-operator">.</span>org<span class="org-haskell-operator">/</span>ghc<span class="org-haskell-operator">/</span>  <span class="org-haskell-constructor">:?</span> for help
<span class="org-haskell-constructor">Wellcome</span> to <span class="org-haskell-constructor">Haskell</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-type">Loaded</span> <span class="org-haskell-type">GHCi</span> configuration from <span class="org-haskell-operator">/</span>home<span class="org-haskell-operator">/</span>archbox<span class="org-haskell-operator">/.</span>ghci
<span class="org-haskell-constructor">Loaded</span> <span class="org-haskell-constructor">GHCi</span> configuration from <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>ghci8295<span class="org-haskell-operator">/</span>ghci<span class="org-haskell-operator">-</span>script
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.Directory</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">D</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> D<span class="org-haskell-definition">.</span>getDirectoryContents <span class="org-string">"/etc/"</span> <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ putStrLn
systemd
motd
adobe
ld<span class="org-haskell-definition">.</span>so<span class="org-haskell-operator">.</span>cache
environment
libreoffice
rc_keymaps
sensors3<span class="org-haskell-definition">.</span>conf
gshadow

<span class="org-haskell-operator">...</span> <span class="org-haskell-operator">...</span> <span class="org-haskell-operator">...</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Paste this function</span>
<span class="org-comment-delimiter">{-</span>
<span class="org-comment">getPassword :: String -&gt; IO () -&gt; IO () -&gt; IO ()         </span>
<span class="org-comment">getPassword password success error = do</span>
<span class="org-comment">  passwd &lt;- putStr "Enter the password: " &gt;&gt; getLine </span>
<span class="org-comment">  if passwd == password</span>
<span class="org-comment">  then success</span>
<span class="org-comment">  else do error</span>
<span class="org-comment">          getPassword password success error</span>
<span class="org-comment">-}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>{
<span class="org-haskell-operator">-</span> getPassword <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>         
<span class="org-haskell-operator">-</span> getPassword password success error <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
<span class="org-haskell-operator">-</span>   passwd <span class="org-haskell-operator">&lt;-</span> putStr <span class="org-string">"Enter the password: "</span> <span class="org-haskell-operator">&gt;&gt;</span> getLine 
<span class="org-haskell-operator">-</span>   <span class="org-haskell-keyword">if</span> passwd <span class="org-haskell-operator">==</span> password
<span class="org-haskell-operator">-</span>   <span class="org-haskell-keyword">then</span> success
<span class="org-haskell-operator">-</span>   <span class="org-haskell-keyword">else</span> <span class="org-haskell-keyword">do</span> error
<span class="org-haskell-operator">-</span>           getPassword password success error
<span class="org-function-name">-</span> <span class="org-haskell-constructor">:</span>}
<span class="org-function-name">getPassword</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> fn a b <span class="org-haskell-operator">=</span> 10 <span class="org-haskell-operator">*</span> a <span class="org-haskell-operator">-</span> b
<span class="org-function-name">fn</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fn</span> 10 20
80
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a
<span class="org-haskell-operator">&gt;</span> it
80
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t forkIO
<span class="org-function-name">forkIO</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">GHC.Conc.Sync.ThreadId</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t threadDelay 
<span class="org-function-name">threadDelay</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forkIO</span> (forever <span class="org-haskell-operator">$</span> threadDelay 1000000 <span class="org-haskell-operator">&gt;&gt;</span> putStrLn <span class="org-string">"Repeat forever with 1 second delay"</span>)
<span class="org-haskell-constructor">ThreadId</span> 82
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">GHC.Conc.Sync.ThreadId</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">Repeat</span> forever with 1 second delay
<span class="org-haskell-constructor">Repeat</span> forever with 1 second delay
<span class="org-haskell-constructor">Repeat</span> forever with 1 second delay
<span class="org-haskell-constructor">Repeat</span> forever with 1 second delay
<span class="org-haskell-constructor">Repeat</span> forever with 1 second delay
<span class="org-haskell-constructor">Repeat</span> forever with 1 second delay
<span class="org-haskell-constructor">Repeat</span> forever with 1 second delay
<span class="org-haskell-constructor">Repeat</span> forever with 1 second delay
     <span class="org-haskell-operator">..</span> <span class="org-haskell-operator">...</span> <span class="org-haskell-operator">...</span> <span class="org-haskell-operator">...</span>
</pre>
</div>
</div>
</div>
