haskell/Tips_And_Tricks.org
*** Extract contents of IO action 

It is useful to extract the value wrapped by an IO action to small
experiments and interactive commands. Note: It is only possible in the
REPL.

Not possible because readFile returns an IO action.

#+BEGIN_SRC haskell 
  > putStrLn (readFile "/etc/lsb-release")

  <interactive>:5:11: error:
      • Couldn't match type ‘IO String’ with ‘[Char]’
        Expected type: String
          Actual type: IO String
      • In the first argument of ‘putStrLn’, namely
          ‘(readFile "/etc/lsb-release")’
        In the expression: putStrLn (readFile "/etc/lsb-release")
        In an equation for ‘it’:
            it = putStrLn (readFile "/etc/lsb-release")
  >

  > :t readFile
  readFile :: FilePath -> IO String

  > let content = readFile "/etc/lsb-release"

  > :t content
  content :: IO String
  > 
               

  > putStrLn content

  <interactive>:9:10: error:
      • Couldn't match type ‘IO String’ with ‘[Char]’
        Expected type: String
          Actual type: IO String
      • In the first argument of ‘putStrLn’, namely ‘content’
        In the expression: putStrLn content
        In an equation for ‘it’: it = putStrLn content
  >

  > :t readFile
  readFile :: FilePath -> IO String

#+END_SRC

*Solutions:*

Extract the IO action content. It is possible due to the Haskell REPL
be inside an IO action.

#+BEGIN_SRC haskell
  > let contentIOaction = readFile "/etc/lsb-release"

  > :t contentIOaction 
  contentIOaction :: IO String
  > 

  > content <- contentIOaction 
  >

  > :t content
  content :: String

  > putStrLn content
  DISTRIB_ID=ManjaroLinux
  DISTRIB_RELEASE=17.0.1
  DISTRIB_CODENAME=Gellivara
  DISTRIB_DESCRIPTION="Manjaro Linux"

  > length content
  110
  >

  > lines content
  ["DISTRIB_ID=ManjaroLinux","DISTRIB_RELEASE=17.0.1","DISTRIB_CODENAME=Gellivara","DISTRIB_DESCRIPTION=\"Manjaro Linux\""]
  > 


  {- -- ========================   Or ======================= --}

  > content <- readFile "/etc/lsb-release"
  > :t content
  content :: String


  > putStrLn content
  DISTRIB_ID=ManjaroLinux
  DISTRIB_RELEASE=17.0.1
  DISTRIB_CODENAME=Gellivara
  DISTRIB_DESCRIPTION="Manjaro Linux"

  > length content
  110
  > 

#+END_SRC

Pass the IO action content using (>>=) bind or (=<<)

#+BEGIN_SRC haskell
  > readFile "/etc/lsb-release" >>= putStrLn
  DISTRIB_ID=ManjaroLinux
  DISTRIB_RELEASE=17.0.1
  DISTRIB_CODENAME=Gellivara
  DISTRIB_DESCRIPTION="Manjaro Linux"

   
  > putStrLn =<< readFile "/etc/lsb-release"
  DISTRIB_ID=ManjaroLinux
  DISTRIB_RELEASE=17.0.1
  DISTRIB_CODENAME=Gellivara
  DISTRIB_DESCRIPTION="Manjaro Linux"
#+END_SRC

