haskell/Tips_And_Tricks.html

<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> Extract contents of IO action</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
It is useful to extract the value wrapped by an IO action to small
experiments and interactive commands. Note: It is only possible in the
REPL.
</p>

<p>
Not possible because readFile returns an IO action.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">putStrLn</span> (readFile <span class="org-string">"/etc/lsb-release"</span>)

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>5<span class="org-haskell-constructor">:</span>11<span class="org-haskell-constructor">:</span> error<span class="org-haskell-constructor">:</span>
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-constructor">Couldn't</span> match <span class="org-haskell-keyword">type</span> &#8216;<span class="org-haskell-type">IO</span> <span class="org-haskell-type">String</span>&#8217; with &#8216;[<span class="org-haskell-type">Char</span>]&#8217;
      <span class="org-haskell-constructor">Expected</span> <span class="org-haskell-keyword">type</span><span class="org-haskell-type">:</span> <span class="org-haskell-type">String</span>
        <span class="org-haskell-constructor">Actual</span> <span class="org-haskell-keyword">type</span><span class="org-haskell-type">:</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">String</span>
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">In</span> the first argument <span class="org-haskell-keyword">of</span> &#8216;putStrLn&#8217;, namely
        &#8216;(readFile <span class="org-string">"/etc/lsb-release"</span>)&#8217;
      <span class="org-haskell-constructor">In</span> the expression<span class="org-haskell-constructor">:</span> putStrLn (readFile <span class="org-string">"/etc/lsb-release"</span>)
      <span class="org-haskell-constructor">In</span> an equation for &#8216;it&#8217;<span class="org-haskell-constructor">:</span>
          it <span class="org-haskell-operator">=</span> putStrLn (readFile <span class="org-string">"/etc/lsb-release"</span>)
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t readFile
<span class="org-function-name">readFile</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">FilePath</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">String</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> content <span class="org-haskell-operator">=</span> readFile <span class="org-string">"/etc/lsb-release"</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t content
<span class="org-function-name">content</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">putStrLn</span> content

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>9<span class="org-haskell-type">:</span>10<span class="org-haskell-type">:</span> error<span class="org-haskell-type">:</span>
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">Couldn't</span> match <span class="org-haskell-keyword">type</span> &#8216;<span class="org-haskell-type">IO</span> <span class="org-haskell-type">String</span>&#8217; with &#8216;[<span class="org-haskell-type">Char</span>]&#8217;
      <span class="org-haskell-constructor">Expected</span> <span class="org-haskell-keyword">type</span><span class="org-haskell-type">:</span> <span class="org-haskell-type">String</span>
        <span class="org-haskell-constructor">Actual</span> <span class="org-haskell-keyword">type</span><span class="org-haskell-type">:</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">String</span>
    <span class="org-haskell-operator">&#8226;</span> <span class="org-haskell-type">In</span> the first argument <span class="org-haskell-keyword">of</span> &#8216;putStrLn&#8217;, namely &#8216;content&#8217;
      <span class="org-haskell-constructor">In</span> the expression<span class="org-haskell-constructor">:</span> putStrLn content
      <span class="org-haskell-constructor">In</span> an equation for &#8216;it&#8217;<span class="org-haskell-constructor">:</span> it <span class="org-haskell-operator">=</span> putStrLn content
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t readFile
<span class="org-function-name">readFile</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">FilePath</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">String</span>
</pre>
</div>

<p>
<b>Solutions:</b>
</p>

<p>
Extract the IO action content. It is possible due to the Haskell REPL
be inside an IO action.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> contentIOaction <span class="org-haskell-operator">=</span> readFile <span class="org-string">"/etc/lsb-release"</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t contentIOaction 
<span class="org-function-name">contentIOaction</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> content <span class="org-haskell-operator">&lt;-</span> contentIOaction 
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t content
<span class="org-function-name">content</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">putStrLn</span> content
<span class="org-haskell-constructor">DISTRIB_ID</span><span class="org-haskell-operator">=</span><span class="org-haskell-constructor">ManjaroLinux</span>
<span class="org-haskell-constructor">DISTRIB_RELEASE</span><span class="org-haskell-operator">=</span>17.0<span class="org-haskell-operator">.</span>1
<span class="org-haskell-constructor">DISTRIB_CODENAME</span><span class="org-haskell-operator">=</span><span class="org-haskell-constructor">Gellivara</span>
<span class="org-haskell-constructor">DISTRIB_DESCRIPTION</span><span class="org-haskell-operator">=</span><span class="org-string">"Manjaro Linux"</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">length</span> content
110
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">lines</span> content
[<span class="org-string">"DISTRIB_ID=ManjaroLinux"</span>,<span class="org-string">"DISTRIB_RELEASE=17.0.1"</span>,<span class="org-string">"DISTRIB_CODENAME=Gellivara"</span>,<span class="org-string">"DISTRIB_DESCRIPTION=\"Manjaro Linux\""</span>]
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">{- </span><span class="org-comment">-- ========================   Or ======================= --}</span>

<span class="org-haskell-operator">&gt;</span> content <span class="org-haskell-operator">&lt;-</span> readFile <span class="org-string">"/etc/lsb-release"</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t content
<span class="org-function-name">content</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">putStrLn</span> content
<span class="org-haskell-constructor">DISTRIB_ID</span><span class="org-haskell-operator">=</span><span class="org-haskell-constructor">ManjaroLinux</span>
<span class="org-haskell-constructor">DISTRIB_RELEASE</span><span class="org-haskell-operator">=</span>17.0<span class="org-haskell-operator">.</span>1
<span class="org-haskell-constructor">DISTRIB_CODENAME</span><span class="org-haskell-operator">=</span><span class="org-haskell-constructor">Gellivara</span>
<span class="org-haskell-constructor">DISTRIB_DESCRIPTION</span><span class="org-haskell-operator">=</span><span class="org-string">"Manjaro Linux"</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">length</span> content
110
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Pass the IO action content using (&gt;&gt;=) bind or (=&lt;&lt;)
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readFile</span> <span class="org-string">"/etc/lsb-release"</span> <span class="org-haskell-operator">&gt;&gt;=</span> putStrLn
<span class="org-haskell-constructor">DISTRIB_ID</span><span class="org-haskell-operator">=</span><span class="org-haskell-constructor">ManjaroLinux</span>
<span class="org-haskell-constructor">DISTRIB_RELEASE</span><span class="org-haskell-operator">=</span>17.0<span class="org-haskell-operator">.</span>1
<span class="org-haskell-constructor">DISTRIB_CODENAME</span><span class="org-haskell-operator">=</span><span class="org-haskell-constructor">Gellivara</span>
<span class="org-haskell-constructor">DISTRIB_DESCRIPTION</span><span class="org-haskell-operator">=</span><span class="org-string">"Manjaro Linux"</span>


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">putStrLn</span> <span class="org-haskell-definition">=&lt;&lt;</span> readFile <span class="org-string">"/etc/lsb-release"</span>
<span class="org-haskell-constructor">DISTRIB_ID</span><span class="org-haskell-operator">=</span><span class="org-haskell-constructor">ManjaroLinux</span>
<span class="org-haskell-constructor">DISTRIB_RELEASE</span><span class="org-haskell-operator">=</span>17.0<span class="org-haskell-operator">.</span>1
<span class="org-haskell-constructor">DISTRIB_CODENAME</span><span class="org-haskell-operator">=</span><span class="org-haskell-constructor">Gellivara</span>
<span class="org-haskell-constructor">DISTRIB_DESCRIPTION</span><span class="org-haskell-operator">=</span><span class="org-string">"Manjaro Linux"</span>
</pre>
</div>
</div>
</div>
