haskell/Tips_And_Tricks.org
*** Load interactive commands from file 
    :PROPERTIES:
    :ID:       56ce68d8-6ae4-415a-99b9-68f5b2d5296c
    :END:

The Ghci directive _:script_ is load interactive commands that could
by typed in Ghci shell from a file.  

File: [[file:src/script_ghci.hs][file:src/script_ghci.hs]]

#+BEGIN_SRC haskell :tangle src/script_ghci.hs

  content <- readFile "/etc/lsb-release"

  let nChars = length content

  putStrLn $ "File content = \n" ++ content

  putStrLn $ "File size (number of chars) = " ++ show nChars

           
  putStrLn "--------------------------------"
           
  :{
  getPassword :: String -> IO () -> IO () -> IO ()         
  getPassword password success error = do
    passwd <- putStr "Enter the password: " >> getLine 
    if passwd == password
    then success
    else do error
            getPassword password success error
  :}


  :{
  showSecreteFile :: String -> IO ()
  showSecreteFile file = do
    content <- readFile file
    putStrLn "Secrete File Content"
    putStrLn content
     
  :}   
    
           
  :{
  getPassword2 :: String -> Int -> IO ()
  getPassword2 password maxTry = aux (maxTry - 1)
    where
      aux counter = do 
        passwd <- putStr "Enter the password: " >> getLine
        case (counter, passwd) of
          _ | passwd == password
                -> showSecreteFile "/etc/shells"
          
          _ | counter == 0
                -> putStrLn $ "File destroyed after " ++ show maxTry ++ " attempts."                 
          _
                -> do putStrLn $ "Try again. You only have " ++ show counter ++ " attempts."
                      aux (counter - 1)                                      
               
  :}
     
  let printLine = putStrLn "-----------------------------------------------"

  printLine                
  putStrLn "Open secrete vault: "
  getPassword "guessthepassword" (putStrLn "Vault opened. Ok.") (putStrLn "Error: Wrong password. Try Again")               
  printLine
  putStrLn "Open secret file: (1)"         
  getPassword2 "xyzVjkmArchp972343asx" 3

  printLine             
  putStrLn "Open secret file: (2)"         
  getPassword2 "xyzVjkmArchp972343asx" 3

               

#+END_SRC


Running: 

#+BEGIN_SRC sh 
  archbox@ghostpc 18:19 ~/Documents/projects/fp-by-example.tutorial/haskell
  $ stack ghci
  Configuring GHCi with the following packages: 
  GHCi, version 8.0.1: http://www.haskell.org/ghc/  :? for help
  Loaded GHCi configuration from /home/archbox/.ghci
  Loaded GHCi configuration from /tmp/ghci7633/ghci-script
  >

  > 
  > :script src/script_ghci.hs 
  File content = 
  DISTRIB_ID=ManjaroLinux
  DISTRIB_RELEASE=17.0.1
  DISTRIB_CODENAME=Gellivara
  DISTRIB_DESCRIPTION="Manjaro Linux"

  File size (number of chars) = 110
  --------------------------------
  -----------------------------------------------
  Open secrete vault: 
  Enter the password: mxkasdasd
  Error: Wrong password. Try Again
  Enter the password: 32423asdas
  Error: Wrong password. Try Again
  Enter the password: guessht^?
  Error: Wrong password. Try Again
  Enter the password: guessthepassword
  Vault opened. Ok.
  -----------------------------------------------
  Open secret file: (1)
  Enter the password: 234asdqa
  Try again. You only have 2 attempts.
  Enter the password: i dont know
  Try again. You only have 1 attempts.
  Enter the password: try again
  File destroyed after 3 attempts.
  -----------------------------------------------
  Open secret file: (2)
  Enter the password: tell me it
  Try again. You only have 2 attempts.
  Enter the password: archxfmksjpfUif83432
  Try again. You only have 1 attempts.
  Enter the password: xyzVjkmArchp972343asx
  Secrete File Content
  #
  # /etc/shells
  #

  /bin/sh
  /bin/bash

  # End of file
  /bin/zsh
  /usr/bin/zsh


#+END_SRC
