haskell/Tips_And_Tricks.html

<div id="outline-container-sec-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><a id="ID-56ce68d8-6ae4-415a-99b9-68f5b2d5296c" name="ID-56ce68d8-6ae4-415a-99b9-68f5b2d5296c"></a><span class="section-number-4">1.6.3</span> Load interactive commands from file</h4>
<div class="outline-text-4" id="text-1-6-3">

<p>
The Ghci directive <span class="underline">:script</span> is load interactive commands that could
by typed in Ghci shell from a file.  
</p>

<p>
File: <a href="src/script_ghci.hs"><a href="src/script_ghci.hs">src/script_ghci.hs</a></a>
</p>

<div class="org-src-container">

<pre class="src src-haskell">content <span class="org-haskell-operator">&lt;-</span> readFile <span class="org-string">"/etc/lsb-release"</span>

<span class="org-haskell-keyword">let</span> nChars <span class="org-haskell-operator">=</span> length content

putStrLn <span class="org-haskell-definition">$</span> <span class="org-string">"File content = \n"</span> <span class="org-haskell-operator">++</span> content

putStrLn <span class="org-haskell-definition">$</span> <span class="org-string">"File size (number of chars) = "</span> <span class="org-haskell-operator">++</span> show nChars


<span class="org-haskell-definition">putStrLn</span> <span class="org-string">"--------------------------------"</span>

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">getPassword</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>         
<span class="org-haskell-definition">getPassword</span> password success error <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  passwd <span class="org-haskell-operator">&lt;-</span> putStr <span class="org-string">"Enter the password: "</span> <span class="org-haskell-operator">&gt;&gt;</span> getLine 
  <span class="org-haskell-keyword">if</span> passwd <span class="org-haskell-operator">==</span> password
  <span class="org-haskell-keyword">then</span> success
  <span class="org-haskell-keyword">else</span> <span class="org-haskell-keyword">do</span> error
          getPassword password success error
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">showSecreteFile</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">showSecreteFile</span> file <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  content <span class="org-haskell-operator">&lt;-</span> readFile file
  putStrLn <span class="org-string">"Secrete File Content"</span>
  putStrLn content

<span class="org-haskell-constructor">:</span>}   


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">getPassword2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">getPassword2</span> password maxTry <span class="org-haskell-operator">=</span> aux (maxTry <span class="org-haskell-operator">-</span> 1)
  <span class="org-haskell-keyword">where</span>
    aux counter <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span> 
      passwd <span class="org-haskell-operator">&lt;-</span> putStr <span class="org-string">"Enter the password: "</span> <span class="org-haskell-operator">&gt;&gt;</span> getLine
      <span class="org-haskell-keyword">case</span> (counter, passwd) <span class="org-haskell-keyword">of</span>
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> passwd <span class="org-haskell-operator">==</span> password
              <span class="org-haskell-operator">-&gt;</span> showSecreteFile <span class="org-string">"/etc/shells"</span>

        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">|</span> counter <span class="org-haskell-operator">==</span> 0
              <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"File destroyed after "</span> <span class="org-haskell-operator">++</span> show maxTry <span class="org-haskell-operator">++</span> <span class="org-string">" attempts."</span>                 
        <span class="org-haskell-keyword">_</span>
              <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Try again. You only have "</span> <span class="org-haskell-operator">++</span> show counter <span class="org-haskell-operator">++</span> <span class="org-string">" attempts."</span>
                    aux (counter <span class="org-haskell-operator">-</span> 1)                                      

<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-keyword">let</span> printLine <span class="org-haskell-operator">=</span> putStrLn <span class="org-string">"-----------------------------------------------"</span>

printLine                
<span class="org-haskell-definition">putStrLn</span> <span class="org-string">"Open secrete vault: "</span>
<span class="org-haskell-definition">getPassword</span> <span class="org-string">"guessthepassword"</span> (putStrLn <span class="org-string">"Vault opened. Ok."</span>) (putStrLn <span class="org-string">"Error: Wrong password. Try Again"</span>)               
printLine
<span class="org-haskell-definition">putStrLn</span> <span class="org-string">"Open secret file: (1)"</span>         
<span class="org-haskell-definition">getPassword2</span> <span class="org-string">"xyzVjkmArchp972343asx"</span> 3

printLine             
<span class="org-haskell-definition">putStrLn</span> <span class="org-string">"Open secret file: (2)"</span>         
<span class="org-haskell-definition">getPassword2</span> <span class="org-string">"xyzVjkmArchp972343asx"</span> 3
</pre>
</div>


<p>
Running: 
</p>

<div class="org-src-container">

<pre class="src src-sh">archbox@ghostpc 18:19 ~/Documents/projects/fp-by-example.tutorial/haskell
$ stack ghci
Configuring GHCi with the following packages: 
GHCi, version 8.0.1: http://www.haskell.org/ghc/  :? for help
Loaded GHCi configuration from /home/archbox/.ghci
Loaded GHCi configuration from /tmp/ghci7633/ghci-script
&gt;

&gt; 
&gt; :script src/script_ghci.hs 
File content = 
<span class="org-variable-name">DISTRIB_ID</span>=ManjaroLinux
<span class="org-variable-name">DISTRIB_RELEASE</span>=17.0.1
<span class="org-variable-name">DISTRIB_CODENAME</span>=Gellivara
<span class="org-variable-name">DISTRIB_DESCRIPTION</span>=<span class="org-string">"Manjaro Linux"</span>

File size (number of chars) = 110
--------------------------------
-----------------------------------------------
Open secrete vault: 
Enter the password: mxkasdasd
<span class="org-function-name">Error</span>: Wrong password. Try Again
Enter the password: 32423asdas
<span class="org-function-name">Error</span>: Wrong password. Try Again
Enter the password: guessht^?
<span class="org-function-name">Error</span>: Wrong password. Try Again
Enter the password: guessthepassword
Vault opened. Ok.
-----------------------------------------------
Open secret file: (1)
Enter the password: 234asdqa
Try again. You only have 2 attempts.
Enter the password: i dont know
Try again. You only have 1 attempts.
Enter the password: try again
File destroyed after 3 attempts.
-----------------------------------------------
Open secret file: (2)
Enter the password: tell me it
Try again. You only have 2 attempts.
Enter the password: archxfmksjpfUif83432
Try again. You only have 1 attempts.
Enter the password: xyzVjkmArchp972343asx
Secrete File Content
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">/etc/shells</span>
<span class="org-comment-delimiter">#</span>

/bin/sh
/bin/bash

<span class="org-comment-delimiter"># </span><span class="org-comment">End of file</span>
/bin/zsh
/usr/bin/zsh
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: nobody</p>
<p class="date">Created: 2018-06-17 Sun 02:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
